[
    {
		"name": "Malacca",
		"leaderName": "Parameswara",
		"adjective": ["Malaccan"],
		"startBias": ["Coast","Avoid [Tundra]","Avoid [Snow]"],
		"preferredVictoryType": "Diplomatic",
		
		"startIntroPart1": "Greatest respects to you, Parameswara, Shah of Singapura and founder of the Malacca Sultanate! Retreating from invading forces in Singapura, you've led your subjects to a peaceful fishing village, which you bestowed the name of Malacca. Owing to its strategic location and your wise rule, Malacca emerged as a center of trade, attracting traders from China, Persia, Arabia and even Europe. After your passing, Malacca had developed into a major hub for trading and religious studies in the region, expanding its influence across the Malay Peninsula and Sumatra at the height of its power, and is the pride of all Malaysians to this day.",
		"startIntroPart2": "O Supreme Lord, your people yearn for prosperity, uniting people from within and beyond. Will you bring both economic and spiritual enlightenment to your nation? Can you create a civilization that will stand the test of time?",
		
		"declaringWar": "We cannot tolerate your aggressions anymore. Prepare.",
		"attacked": "Our brave warriors will repel your aggressions at all costs!",
		"defeated": "You may have defeated me, but Malacca shall stand for ages to come!",
		"introduction": "A pleasure to meet you. I am Parameswara, ruler of Malacca and the Malay realm.",
		
		"neutralHello": "How are you today?",
		"hateHello": "What are you here for?",
		
		"tradeRequest": "How do you think about this offer?",
				
		"outerColor": [1,0,138],
		"innerColor": [254,215,0],
		"uniqueName": "Strait of Malacca",
		"uniques": ["[+1 Gold, +1 Culture, +1 Faith] from each Trade Route",
            "Gifts of Gold to City-States generate [10]% more Influence"],
		"cities": [
            "Malacca","Singapura","Kuala Lumpur","Johor Bahru","Klang",
            "Muar","Shah Alam","Putrajaya","Georgetown","Ipoh",
            "Alor Setar","Kuantan","Pulau Langkawi","Seberang Perai","Seremban",
            "Kota Bahru","Kangar","Kuala Terengganu","Cyberjaya",
            "Sepang","Port Dickson","Pattani","Petaling Jaya","Kota Tinggi",
            "Pasir Gudang","Tanah Rata","Raub","Subang Jaya","Pulau Pangkor"
        ]
	}
]